app/controllers/bathrooms_controller.rb

INSERT INTO "bathrooms" ("address", "bathroomtype_id", "city", "created_at", "hasAttendent", "hasProductDispenser", "hasSignage", "hasWifi", "isFamily", "isGreen", "isHandicapAccessible", "isHandsFree", "isPublic", "isUnisex", "lat", "lng", "name", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "bathrooms" SET "bathroomtype_id" = 8, "updated_at" = '2012-10-06 19:26:40.841283' WHERE "bathrooms"."id" = 9
INSERT INTO "bathroomtypes" ("btype", "created_at", "updated_at") VALUES (?, ?, ?)  [["btype", nil], ["created_at", Sat, 06 Oct 2012 19:23:47 UTC +00:00], ["updated_at", Sat, 06 Oct 2012 19:23:47 UTC +00:00]]
---
  def add

    # GET /bathroom/add
    # http://something.com/bathroom/add?name=Test&address=Blah&...

    bathroom = Bathroom.create

    bathroom.isHandicapAccessible = params[:isHandicapAccessible]
    bathroom.isPublic = params[:isPublic]
    bathroom.isFamily = params[:isFamily]
    bathroom.isGreen = params[:isGreen]
    bathroom.isUnisex = params[:isUnisex]
    bathroom.isHandsFree = params[:isHandsFree]
    bathroom.hasProductDispenser = params[:hasProductDispenser]
    bathroom.hasAttendent = params[:hasAttendant]
    bathroom.hasSignage = params[:hasSignage]
    bathroom.hasWifi = params[:hasWifi]
    bathroom.name = params[:name]
    bathroom.address = params[:address]
    bathroom.city = params[:city]
    bathroom.state = params[:state]
    bathroom.zip = params[:zip]
    bathroom.lat = params[:lat]
    bathroom.lng = params[:lng]
    bathroom.save

    bathroomType = Bathroomtype.find_or_create_by_btype(params[:bathroomType])